Revit 2027 API
ExternalDataManagerCommand Properties
The ExternalDataManagerCommand type exposes the following members.
Properties
Name | Description
Executable |  Indicates if the command is executable.
Id |  The id of the command.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Name |  The name of the command.
SupportMultiItems |  Indicates if the command support manipulate multiple items in one execution.
Tooltip |  The tooltip of the command.
Top
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace